{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report JSON containing an empty features array.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to their human‑written summaries.",
  "frontend/index.css": "Tailwind‑based global styles defining OKLCH color variables and theme settings for light and dark modes.",
  "frontend/index.html": "HTML app entry with Inter font, jsPDF CDN, metadata, and root div.",
  "frontend/src/App.tsx": "Renders the MiningHub PDF generator page as the main application view.",
  "frontend/src/content/mininghubPlan.ts": "Typed data model and full MiningHub investment plan content including Hindi copy, plan values, mining explainer, and PDF text labels.",
  "frontend/src/features/calculator/incomeCalculator.ts": "Utility functions to compute monthly income and total income including team and level rewards.",
  "frontend/src/features/pdf/downloadPdf.ts": "Triggers browser download of a PDF Blob via a temporary anchor element.",
  "frontend/src/features/pdf/generateMiningHubPlanPdf.ts": "Creates a multi‑section investment plan PDF using jsPDF with images, layout logic, and MiningHub data.",
  "frontend/src/features/pdf/loadPdfImageAssets.ts": "Loads local images as base64 strings for PDF embedding using canvas conversion.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and refreshes an authenticated or anonymous backend actor via Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Full Internet Identity authentication context and provider handling login, stored identity, and status.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind base layers and global CSS variables for light/dark themes and applies global typography/background styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/MiningHubPdfGeneratorPage.tsx": "Renders the MiningHub PDF generator UI, showing plan details and triggering PDF creation and download.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors using CSS variables, typography, animations, container settings, and plugins.",
  "project_state.json": "Stores project metadata, implemented features, and requirements related to generating a styled MiningHub PDF."
}