{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence file listing implemented PDF language changes and a new crypto mining explainer section with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files related to the MiningHub PDF generator.",
  "frontend/index.css": "Tailwind-based global styles defining color tokens, dark mode variants, and base layout behavior.",
  "frontend/index.html": "HTML entry point loading fonts, jsPDF, and mounting the React app.",
  "frontend/src/App.tsx": "Root React component rendering the MiningHub PDF generator page.",
  "frontend/src/content/mininghubPlan.ts": "Typed Hindi content and configuration for the MiningHub investment plan, including crypto mining explainer and PDF copy strings.",
  "frontend/src/features/calculator/incomeCalculator.ts": "Utility functions for calculating monthly and total potential income.",
  "frontend/src/features/pdf/downloadPdf.ts": "Helper function that triggers browser download of a generated PDF.",
  "frontend/src/features/pdf/generateMiningHubPlanPdf.ts": "Main jsPDF generator building the multi-section Hindi investment plan PDF with images and formatting.",
  "frontend/src/features/pdf/loadPdfImageAssets.ts": "Loads local images as base64 for embedding into the generated PDF.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom OKLCH color variables for light and dark themes, setting global styles and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider before rendering.",
  "frontend/src/pages/MiningHubPdfGeneratorPage.tsx": "Implements the UI for generating and downloading the MiningHub investment plan PDF, displaying plan details and triggering PDF generation.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the project's design system.",
  "project_state.json": "Stores project metadata, feature requirements, and current progress relating to the MiningHub PDF generation functionality."
}